{
  "PasswordGenerator": {
    "title": "Generador de Contraseñas",
    "description": "Genera contraseñas seguras y fuertes al instante",
    "options": "Opciones",
    "length": "Longitud",
    "uppercase": "Letras Mayúsculas",
    "lowercase": "Letras Minúsculas",
    "numbers": "Números",
    "symbols": "Símbolos",
    "generate": "Generar Contraseña",
    "copy": "Copiar",
    "copied": "¡Copiado!",
    "passwordType": "Tipo de Contraseña",
    "random": "Aleatoria",
    "memorable": "Memorable",
    "pin": "PIN",
    "wordCount": "Cantidad de Palabras",
    "pinLength": "Longitud del PIN",
    "strength": "Fortaleza de la Contraseña",
    "weak": "Débil",
    "moderate": "Moderada",
    "strong": "Fuerte",
    "veryStrong": "Muy Fuerte"
  },
  "PasswordStrengthChecker": {
    "title": "Verificador de Fortaleza de Contraseñas",
    "description": "Comprueba qué tan fuerte es tu contraseña",
    "enterPassword": "Introduce tu contraseña",
    "strength": "Fortaleza",
    "veryWeak": "Muy Débil",
    "weak": "Débil",
    "moderate": "Moderada",
    "strong": "Fuerte",
    "veryStrong": "Muy Fuerte",
    "requirements": "Requisitos de Contraseña",
    "atLeast8Chars": "Al menos 8 caracteres",
    "uppercase": "Contiene letras mayúsculas",
    "lowercase": "Contiene letras minúsculas",
    "number": "Contiene números",
    "specialChar": "Contiene caracteres especiales",
    "goodPassword": "¡Buena contraseña! Cumple con las recomendaciones de seguridad.",
    "improvePassword": "Considera mejorar tu contraseña para cumplir con todos los requisitos."
  },
  "PasswordTips": {
    "title": "Consejos y Mejores Prácticas de Seguridad para Contraseñas",
    "whyImportant": "Por Qué Son Importantes las Contraseñas Fuertes",
    "importanceDescription": "Las contraseñas fuertes son tu primera línea de defensa contra el acceso no autorizado a tus cuentas. Con las filtraciones de datos cada vez más comunes, tener contraseñas seguras y únicas para cada una de tus cuentas es más importante que nunca.",
    "bestPractices": "Mejores Prácticas para Contraseñas",
    "tip1": "Usa un mínimo de 12 caracteres, con una mezcla de mayúsculas, minúsculas, números y símbolos",
    "tip2": "Evita usar información personal como nombres, fechas de nacimiento o palabras comunes",
    "tip3": "Crea contraseñas únicas para cada cuenta para evitar que una sola filtración comprometa múltiples cuentas",
    "tip4": "Considera usar un gestor de contraseñas para almacenar y generar contraseñas complejas de forma segura",
    "tip5": "Activa la autenticación de dos factores (2FA) siempre que sea posible para una capa adicional de seguridad",
    "tip6": "Cambia las contraseñas inmediatamente si sospechas que una cuenta ha sido comprometida",
    "tip7": "Utiliza técnicas mnemotécnicas para crear contraseñas memorables pero seguras",
    "mnemonicTechniques": "Uso de Técnicas Mnemotécnicas",
    "mnemonicDescription": "Las contraseñas mnemotécnicas son más fáciles de recordar sin dejar de ser seguras. Nuestro generador de contraseñas puede crear contraseñas mnemotécnicas tanto en inglés como en español, utilizando listas de palabras y reglas gramaticales específicas de cada idioma.",
    "exampleTitle": "Ejemplo de una Contraseña Mnemotécnica",
    "exampleText": "En lugar de 'C0ntr@señ4', prueba 'Los5ElefantesVerdesBailaronFelizmente!' - Es más larga, más compleja, pero también más fácil de recordar porque crea una imagen mental.",
    "commonMistakes": "Errores Comunes de Contraseñas a Evitar",
    "mistake1": "Usar la misma contraseña en múltiples sitios",
    "mistake2": "Crear contraseñas demasiado cortas o simples",
    "mistake3": "Usar información personal obvia (nombres de mascotas, fechas de nacimiento, etc.)",
    "mistake4": "Anotar contraseñas en papel o en notas digitales no seguras",
    "mistake5": "No cambiar las contraseñas después de una filtración de datos conocida",
    "passwordManagers": "El Papel de los Gestores de Contraseñas",
    "managersDescription": "Los gestores de contraseñas son aplicaciones seguras que almacenan y administran tus contraseñas. Pueden generar contraseñas fuertes y únicas para cada sitio que uses, y solo necesitas recordar una contraseña maestra para acceder a todas ellas.",
    "tipBoxTitle": "Consejo Profesional:",
    "tipBoxContent": "Nuestro generador de contraseñas crea contraseñas fuertes que puedes usar con tu gestor de contraseñas. La opción mnemotécnica es perfecta para crear una contraseña maestra fuerte que realmente puedas recordar.",
    "conclusion": "Conclusión",
    "conclusionText": "Tomar en serio la seguridad de las contraseñas es esencial en el mundo digital actual. Siguiendo estas mejores prácticas y utilizando herramientas como nuestro generador de contraseñas, puedes reducir significativamente el riesgo de comprometer tus cuentas y sufrir robo de identidad.",
    "tryGenerator": "Prueba Nuestro Generador de Contraseñas",
    "generatorPromo": "¿Listo para crear contraseñas más fuertes? Nuestro generador de contraseñas gratuito crea contraseñas aleatorias y seguras al instante. También cuenta con una opción única de contraseña mnemotécnica para crear contraseñas memorables pero seguras tanto en inglés como en español.",
    "generateButton": "Generar una Contraseña Ahora"
  },
  "Metadata": {
    "title": "Generador de Contraseñas - Crea Contraseñas Seguras y Fuertes",
    "description": "Genera contraseñas seguras, fuertes y únicas al instante. Herramienta gratuita de generación de contraseñas aleatorias, PIN y frases memorables."
  },
  "Navigation": {
    "title": "Generador de Contraseñas",
    "generator": "Generador",
    "tips": "Consejos de Contraseñas",
    "language": "Idioma"
  }
}
